==Панели каталогов==
Meta + g/r/j - переход на верхний, средний или нижний файл
Meta + t- переключить режим отображения 
Ctrl + \- показать «Справочник каталогов»
+ - выбрать группу файлов по регулярному выражению
\- снять отметку с группы файлов
Meta + o - открыть выделенный/родительский каталог в другой панели
Meta + i- открыть текущий каталог в другой панели
Meta + y - к предыдущему каталогу из истории перемещения
Meta + u- к следующему каталогу из истории перемещения
Meta + H - отображает историю перемещения по каталогам
Meta + . - отобразить скрытые файлы
Ctrl + u - поменять панели местами
Meta+c- быстрый переход в другой каталог
==Разные команды==
Ctrl + x,c - поменять права (chmod) для отмеченных файлов
Ctrl + x,o- поменять владельца (chown) для отмеченных файлов
Ctrl + x,l - создать жёсткую ссылку
Ctrl + x,s- создать абсолютную символическую ссылку
Ctrl + x,v - создать относительную символическую ссылку
Ctrl + x,i- переводит пассивную панель в режим «Информация»
Ctrl + x,q - переводит пассивную панель в режим быстрого просмотра
Ctrl + x,h - добавить имя каталога в «Справочник каталогов»
Ctrl + x,j - Показ фоновых задач 
Meta + !- меню → «Просмотр вывода команды»
Meta + c- окно «Быстрая смена каталога»
Ctrl + o - скрыть/показать панели
Ctrl + Space- подсчёт размера каталога
Ctrl + r - перечитать содержимое каталога
Ctrl + x,j- показать фоновые задания
Ctrl + x,d - сравнить каталоги
Ctrl + x, Ctrl + d - сравнить файлы
Ctrl+x,Ctrl+s- Редактировать символическую ссылку 
Shift+F4- Создает новый файл 
Shift + F6 - переименовать файл
==Быстрый поиск==
Ctrl/Meta + s- режим быстрого поиска
Meta+Shift+?- Вызывается меню расширенного поиска файлов 
==Командная строка оболочки==
Ctrl/Meta + Enter- копирует подсвеченное имя файла в командную строку
Ctrl + x,t - копирует в командную строку имена помеченных файлов
Ctrl+x,p - Посылает в командную строку полный путь 
Ctrl + x p - копиреут путь в командную строку
Meta + p/n - перемещение по истории команд
Meta + h- выводит историю текущей строки ввода (историю команд)
Ctrl + V - вставка из буфера обмена
