== Перемещение по тексту ==
0 ("zero") - в начало текущей строки;
^ - в начало текущей строки
$ - в конец текущей строки
Ctrl + f - на страницу (экран) вниз
Ctrl + b - на страницу (экран) верх
w/W  - Вперед к началу "маленького"/"большого" слова
b/B - Назад к началу "маленького"/"большого" слова.
e/E - Вперед к концу "маленького"/"большого" слова.
H - Перейти к началу экрана.
M - Перейти в центр экрана.
L - Перейти в конец экрана.
% - Переход на противоположную скобку: ()[]...
Ctrl + ] - Переход по ссылке или на определение функции.
Ctrl + T - Возврат после перехода по ссылке.
Ctrl + O - Назад по списку переходов.
:N - переход на N-ую строку файла
== История ==
u - откат действий (undo)
U - откат действий всей строки
CTRL+R - откат отката (redo)
== Редактирование ==
i - Вставка перед курсором
I - Вставка в начало строки
a - Вставка после курсора
A - Вставка в конце строки
o - Открытие новой строки после текущей строк
O - Открытие новой строки перед текущей строкой
p - вставка из буфера после курсора
P, MidMouse - Вставка из буфера перед курсором.
r - Замена одного символа
R - Замена нескольких символов
y - копировать
yy - копировать строку
d - Удаление текста
D - Удалить от текущего символа до конца строки
c - удаление текста, затем в режим вставки
C - Удалить до конца строки, переход в режим ввода
s - синоним cl (изменяет один символ)
S - синоним cc (изменяет всю строку)
J - Объединить строку с последующей.
== Вкладки ==
:tabnew [filename] - Открыть новую вкладку
gt or :tabn - Следующая вкладка
gT or :tabp - Предыдущая вкладка
:tabc[lose] [tab_num] - Закрывает вкладку.
