''Вместо Alt клавиши, можно использовать Esc''
==Передвижение==
Ctrl + a - Переход к началу строки (аналог клавиши Home)
Ctrl + e - Переход к концу строки
Alt + f - Передвижение курсора вправо к следующему слову
Alt + b - Передвижение курсора влево к предыдущему слову
Alt + / - Дополнение имени файла из тех что есть в каталоге
==Редактирование==
Ctrl + u - Удалить текст слева от курсора до начала строки
Ctrl + k - Удалить текст справа от курсора до конца строки
Ctrl + w - Удаляет текст слева от текущей позиции курсора до пробела
Alt + d - Удаление текста справа от текущей позиции до пробела
Alt + \ - Удаление всех пробелов между словами
Alt + r - Очистить всю строку
Ctrl + y - Вставка текста из буфера (весь удаляемый текст помещается именно туда)
Ctrl + _ - Отмена последних выполняемых действий
Ctrl + t - Меняет 1 символ слева на текущей позиции курсора
Alt + t - Поменять слова местами (вместо клавиши Alt, можно использовать Esc)
Alt + u - Сделать все буквы заглавными от текущей позиции курсора до конца слова
Alt + . - Вставка последнего аргумента из последней строки
==История команд==
Ctrl + r - Поиск по истории набранных команд
Ctrl + R - Обратный поиск по истории набранных команд
Ctrl +n - следующая команда в истории
Ctrl + p - предыдущая команда в истории
!! - Выполнить последнюю команду в истории
!abc - Выполнить последнюю команду в истории начинающуюся с abc
!abc:p - Вывести на экран все команды которые начинались на a
!n - Выполнить n-ую команду в истории
!$ - Последний аргумент из последней команды
!^ - Первые аргумент из последней команды
==Управление==
Ctrl + z - Отправить выполение команды в фон
Ctrl + c - Прервать выполнение команды
Ctrl + s - остановить вывод на экран
Ctrl + q - продолжить вывод на экран
Ctrl + l - Очистить экран (набранная строка и позиция курсора остается)
==Действия с Tab’ом==
2T - Все доступные команды
(abc)2T - Все доступные команды начинающиеся на abc
/2T - Все каталоги, включая скрытые
./2Т - Все каталоги, включая скрытые для текущего
*2T - Каталоги, кроме скрытых
~2T - Все пользователи, присутствющие в /etc/passwd
~f2T - Все пользователи, присутствющие в /etc/passwd которые начинаются на f
$2T - Все системные переменные
@2T - Все записи в /etc/hosts
